console.log("%c Самооценка 85/190","color:#fff;background: #000");
console.log("%c Базовая структура: (+5) На сайте должно быть два вида: «Гараж» и «Победители».","color:#fff;background: #000")
console.log("%c (+5) Представление «Гараж» должно содержать его название, номер страницы и полное количество объектов в базе (сколько машин у пользователя в гараже).","color:#fff;background: #000");
console.log("%c (+5) Представление «Победители» должно содержать его название, номер страницы и полное количество элементов в базе данных (сколько записей содержит таблица победителей).","color:#fff;background: #000");
console.log("%c (+10) Состояние просмотра должно сохраняться, когда пользователь переключается с одного представления на другое. Например, номер страницы не должен сбрасываться, элементы управления вводом должны содержать то, что они содержали до переключения и т. д.)","color:#fff;background: #000");
console.log("%c Вид «Гараж»: (+15) Пользователь должен иметь возможность создавать, обновлять, удалять автомобили и видеть список автомобилей. У автомобиля всего два атрибута: «имя» и «цвет». Для операции «удалить» автомобиль должен быть удален как из таблицы «гараж», так и из таблицы «победители».","color:#fff;background: #000");
console.log("%c (+10) Пользователь должен иметь возможность выбрать любой цвет из палитры RGB, как здесь, и увидеть изображение автомобиля, окрашенного в выбранный цвет и название автомобиля.","color:#fff;background: #000");
console.log("%c (+5) Рядом с изображением автомобиля должны быть кнопки для обновления его атрибутов или удаления.","color:#fff;background: #000");
console.log("%c (+10) На виде 'Гараж' должна быть нумерация страниц (7 машин на одной странице). ","color:#fff;background: #000");
console.log("%c (+10) Должна быть кнопка создания случайных машин (100 машин за клик). Название должно быть собрано из двух случайных частей, например «Tesla» + «Model S» или «Ford» + «Mustang» (не менее 10 разных имен для каждой части). Цвет также должен генерироваться случайным образом.","color:#fff;background: #000");
console.log("%c (0) Автомобильная анимация","color:#fff;background: #000");
console.log("%c (0) Анимация гонки:","color:#fff;background: #000");
console.log("%c Вид «Победители» (+10)","color:#fff;background: #000");
console.log("%c (+5) Должна быть нумерация страниц (10 победителей на одной странице).","color:#fff;background: #000");
console.log("%c (+5) Таблица должна содержать следующие столбцы: «№», «Изображение автомобиля», «Название автомобиля», «Количество побед», «Лучшее время в секундах» (названия столбцов могут отличаться). Если один и тот же автомобиль выигрывает более одного раза, количество побед должно быть увеличено, а лучшее время должно быть сохранено, только если оно лучше сохраненного.","color:#fff;background: #000");
